[
  {
    "title": "ประเทศไทย",
    "url_image": "https://raw.githubusercontent.com/Soravit-Ice/FlutterApi_ProjectLayout/main/thailand.jpg",
    "detail_sub": "ประเทศไทยเป็นประเทศที่ใหญ่ที่สุดเป็นอันดับที่ 50 ของโลก มีเนื้อที่513,120 ตารางกิโลเมตร ตั้งอยู่ในกลางภูมิภาคเอเซียตะวันออกเฉียงใต้",
    "detail": "ประเทศไทย มีชื่ออย่างเป็นทางการว่า ราชอาณาจักรไทย เป็นรัฐชาติอันตั้งอยู่ในภูมิภาคเอเชียตะวันออกเฉียงใต้ เดิมมีชื่อว่า 'สยาม' รัฐบาลประกาศเปลี่ยนชื่อเป็นประเทศไทยอย่างเป็นทางการตั้งแต่ปี 2482 ประเทศไทยมีขนาดใหญ่เป็นอันดับที่ 50 ของโลก มีเนื้อที่ 513,120 ตารางกิโลเมตร[12] และมีประชากรมากเป็นอันดับที่ 20 ของโลก คือ ประมาณ 69 ล้านคน มีอาณาเขตติดต่อกับประเทศพม่าทางทิศเหนือและตะวันตก ประเทศลาวทางทิศเหนือและตะวันออก ประเทศกัมพูชาทางทิศตะวันออก และประเทศมาเลเซียทางทิศใต้ กรุงเทพมหานครเป็นศูนย์กลางการบริหารราชการแผ่นดินและนครใหญ่สุดของประเทศ และการปกครองส่วนภูมิภาค จัดระเบียบเป็น 76 จังหวัด[13] แม้จะมีการสถาปนาระบอบราชาธิปไตยภายใต้รัฐธรรมนูญและประชาธิปไตยระบบรัฐสภาในปี 2475 แต่กองทัพยังมีบทบาทในการเมืองไทยสูง โดยมีรัฐประหารครั้งล่าสุดในปี 2557 \n\nพบหลักฐานการอยู่อาศัยอย่างต่อเนื่องในอาณาเขตประเทศไทยปัจจุบันตั้งแต่ 20,000 ปีก่อนคริสตกาล ชาวไทเริ่มอพยพเข้าสู่บริเวณนี้ในคริสต์ศตวรรษที่ 11 แล้วเข้ามาตั้งแว่นแคว้นต่าง ๆ ที่สำคัญได้แก่ อาณาจักรสุโขทัย อาณาจักรล้านนาและอาณาจักรอยุธยา นักประวัติศาสตร์มักถือว่าอาณาจักรสุโขทัยเป็นจุดเริ่มต้นของประวัติศาสตร์ไทย ต่อมาอาณาจักรอยุธยาค่อย ๆ เรืองอำนาจมากขึ้นจนเป็นมหาอำนาจในภูมิภาคในปลายคริสต์ศตวรรษที่ 14 แทนจักรวรรดิเขมร อาณาจักรอยุธยาสามารถผนวกสุโขทัยเข้าเป็นส่วนหนึ่งของตนได้ การติดต่อกับชาติตะวันตกเริ่มด้วยผู้แทนทางทูตชาวโปรตุเกสในปี 2054 การสงครามกับพม่านำไปสู่การเสียกรุงในปี 2112 แต่สมเด็จพระนเรศวรมหาราช ทรงประกาศอิสรภาพในเวลา 15 ปี อาณาจักรรุ่งเรืองอย่างมากในรัชกาลสมเด็จพระนารายณ์มหาราช แต่หลังจากนั้นค่อย ๆ เสื่อมอำนาจโดยมีสาเหตุส่วนหนึ่งจากการผลัดแผ่นดินที่มีการนองเลือดหลายรัชกาล จนสุดท้ายกรุงศรีอยุธยาถูกทำลายสิ้นเชิงในปี 2310 สมเด็จพระเจ้ากรุงธนบุรี ทรงรวบรวมแผ่นดินที่แตกออกเป็นก๊กต่าง ๆ และสถาปนาอาณาจักรธนบุรีที่มีอายุ 15 ปี ความวุ่นวายในช่วงปลายอาณาจักรนำไปสู่การสำเร็จโทษพระองค์โดยพระบาทสมเด็จพระพุทธยอดฟ้าจุฬาโลกมหาราช ปฐมราชวงศ์จักรีแห่งกรุงรัตนโกสินทร์"
  },
  {
    "title": "ประเทศเกาหลี",
    "url_image": "https://raw.githubusercontent.com/Soravit-Ice/FlutterApi_ProjectLayout/main/korea.jpg",
    "detail_sub": "สาธารณรัฐเกาหลี หรือที่เรียกกันทั่วไปว่า เกาหลีใต้ (อังกฤษ: South Korea) เป็นประเทศในเอเชียตะวันออก มีพื้นที่ครอบคลุมส่วนใต้ของคาบสมุทรเกาหลี",
    "detail": "ประวัติศาสตร์เริ่มจากอาณาจักรโชซ็อนโบราณ สถาปนาขึ้นโดย 'ทันกุน' ต่อมาสมัยสามอาณาจักรแห่งเกาหลี (โคกูรยอ, แพ็กเจ, และชิลลา) ถูกรวมเข้าด้วยกันเป็นสหอาณาจักรชิลลา ซึ่งมีพุทธศาสนาเจริญรุ่งเรือง และต่อมา ค.ศ. 918 ได้สถาปนาอาณาจักรโครยอซึ่งเป็นชื่อของเกาหลี (Korea) และเมื่อราชวงศ์โชซ็อน (ราชวงศ์ลี) ครองอำนาจเปลี่ยนชื่ออาณาจักรใหม่ ชื่อ อาณาจักรโชซ็อนเมืองหลวงชื่อว่า ฮันยาง (โซล) มีลัทธิขงจื๊อ เป็นคติธรรมประจำชาติ และได้ประดิษฐ์อักษรเกาหลี ขึ้น"
  },
  {
    "title": "ประเทศญี่ปุ่น",
    "url_image": "https://raw.githubusercontent.com/Soravit-Ice/FlutterApi_ProjectLayout/main/japan.jpg",
    "detail_sub": "ประเทศญี่ปุ่น (ญี่ปุ่น: 日本 โรมาจิ: Nihon/Nippon ทับศัพท์: นิฮง/นิปปง, ชื่ออย่างเป็นทางการ ญี่ปุ่น: 日本国 โรมาจิ: Nihon-koku/Nippon-koku ทับศัพท์: นิฮงโกกุ/นิปปงโกกุ)",
    "detail": "ประเทศญี่ปุ่น (ญี่ปุ่น: 日本 โรมาจิ: Nihon/Nippon ทับศัพท์: นิฮง/นิปปง, ชื่ออย่างเป็นทางการ ญี่ปุ่น: 日本国 โรมาจิ: Nihon-koku/Nippon-koku ทับศัพท์: นิฮงโกกุ/นิปปงโกกุ) เป็นรัฐเอกราชหมู่เกาะในเอเชียตะวันออก ตั้งอยู่ในมหาสมุทรแปซิฟิกนอกฝั่งตะวันออกของแผ่นดินใหญ่เอเชีย ทางตะวันตกติดกับคาบสมุทรเกาหลีและประเทศจีน โดยมีทะเลญี่ปุ่นกั้น ส่วนทางทิศเหนือติดกับประเทศรัสเซีย มีทะเลโอค็อตสค์เป็นเส้นแบ่งแดน\n\nตัวอักษรคันจิของชื่อญี่ปุ่นแปลว่า 'ถิ่นกำเนิดของดวงอาทิตย์' จึงทำให้มักได้ชื่อว่า 'ดินแดนแห่งอาทิตย์อุทัย' ประเทศญี่ปุ่นเป็นกลุ่มเกาะกรวยภูเขาไฟสลับชั้นซึ่งมีเกาะประมาณ 6,852 เกาะ เกาะใหญ่สุดคือ เกาะฮนชู ฮกไกโด คีวชู และชิโกกุ ซึ่งคิดเป็นพื้นที่แผ่นดินประมาณร้อยละ 97 ของประเทศญี่ปุ่น และมักเรียกว่าเป็นหมู่เกาะเหย้า (home islands) ประเทศแบ่งเป็น 47 จังหวัดใน 8 ภูมิภาค โดยมีฮกไกโดเป็นจังหวัดเหนือสุด และโอกินาวะเป็นจังหวัดใต้สุด ประเทศญี่ปุ่นมีประชากร 127 ล้านคน เป็นประเทศที่มีประชากรมากที่สุดเป็นอันดับ 11 ของโลก ชาวญี่ปุ่นเป็นร้อยละ 98.5 ของประชากรทั้งหมดของประเทศญี่ปุ่น ประมาณ 9.1 ล้านคนอาศัยอยู่ในกรุงโตเกียว[8] เมืองหลวงของประเทศ"
  },
  {
    "title": "ประเทศอเมริกา",
    "url_image": "https://raw.githubusercontent.com/Soravit-Ice/FlutterApi_ProjectLayout/main/usa.jpg",
    "detail_sub": "สหรัฐอเมริกา (อังกฤษ: United States of America) โดยทั่วไปเรียก สหรัฐ (United States) หรือ อเมริกา (America) เป็นสหพันธ์สาธารณรัฐ ประกอบด้วยรัฐ 50 รัฐ",
    "detail": "สหรัฐอเมริกา (อังกฤษ: United States of America) โดยทั่วไปเรียก สหรัฐ (United States) หรือ อเมริกา (America) เป็นสหพันธ์สาธารณรัฐ ประกอบด้วยรัฐ 50 รัฐ และหนึ่งเขตปกครองกลาง ห้าดินแดนปกครองตนเองสำคัญ และเกาะเล็กต่าง ๆ[fn 3] โดย 48 รัฐและเขตปกครองกลางตั้งอยู่ ณ ทวีปอเมริกาเหนือระหว่างประเทศแคนาดาและเม็กซิโก รัฐอะแลสกาอยู่มุมตะวันตกเฉียงเหนือของทวีปอเมริกาเหนือ มีเขตแดนติดต่อกับประเทศแคนาดาทางทิศตะวันออกและข้ามช่องแคบเบริงจากประเทศรัสเซียทางทิศตะวันตก และรัฐฮาวายเป็นกลุ่มเกาะในมหาสมุทรแปซิฟิกกลาง ดินแดนของสหรัฐกระจายอยู่ตามมหาสมุทรแปซิฟิกและทะเลแคริบเบียน ครอบคลุมเขตเวลาเก้าเขต ภูมิศาสตร์ ภูมิอากาศและสัตว์ป่าของประเทศหลากหลายอย่างยิ่ง"
  }
]
